app/views/articles/_attachment.html.erb

<% @article.attachments.each do |image| %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."article_id" = ?  [["article_id", 3]]