app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "articles"."id" = ?  [["image_updated_at", 2016-09-04 11:21:42 UTC], ["updated_at", 2016-09-04 11:21:42 UTC], ["image_file_name", "pear.png"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(article_params)